0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.024;

boundaryField
{
    

    
    inlet
	{
		type  			fixedValue;
		value 			$internalField;
	}

    outlet
    {
        type            fixedValue;
    	value 			$internalField;
    }

    road
    {
        type            zeroGradient;
    }

    car
    {
        type            zeroGradient;
    }

   top
	{
    	type 			zeroGradient;
	}
    
	frontAndBack
	{
		type 			empty;
	}

}


// ************************************************************************* //
