system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother		GaussSeidel;
        nSweeps         2;
        tolerance       1e-05;
        relTol          0.01;       
    }
    
    U
    {

        solver          smoothSolver;
        smoother		GaussSeidel;
        nSweeps         2;
        tolerance       1e-05;
        relTol          0.1;
    }

    k
    {
        solver          smoothSolver;
        smoother		GaussSeidel;
        nSweeps         2;
        tolerance       1e-05;
        relTol          0.1;
    }
    omega
    {
        solver          smoothSolver;
        smoother		GaussSeidel;
        nSweeps         2;
        tolerance       1e-05;
        relTol          0.1;
    }
}

SIMPLEC
{
    nNonOrthogonalCorrectors 1;

	
    residualControl
    {
        p               1e-5;
        U               1e-5;
        "(k|omega|f|v2)" 1e-5;
    }
}


relaxationFactors
{
    equations
    {
        p		1;
		U		0.9;
		k		0.9;
		omega	0.9;  
    }
}


// ************************************************************************* //
